**Exploración inicial de los datos para identificar posibles problemas, como valores nulos, atípicos o datos faltantes en las columnas relevantes.**

In [1]:
# Importación librería

In [2]:
import pandas as pd

Lectura de archivo Customer Flight Activity.

In [3]:
df_flight = pd.read_csv("Customer Flight Activity.csv") # no utilizamos index_col = 0 para que no ponga como indice loyalty number

Visualización del archivo

In [4]:
df_flight.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [5]:
df_flight.sample(20)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
97953,815584,2017,6,0,0,0,0,0.00,0,0
264242,603407,2018,2,9,0,9,3159,393.75,0,0
253079,208368,2018,4,8,0,8,2168,270.00,0,0
368977,871203,2018,4,5,2,7,693,74.52,373,30
117786,971030,2017,7,0,0,0,0,0.00,0,0
179186,641384,2017,11,0,0,0,0,0.00,0,0
168676,981198,2017,10,0,0,0,0,0.00,0,0
314508,794348,2018,9,0,0,0,0,0.00,0,0
365939,915243,2017,7,7,0,7,3759,375.00,0,0
50250,974617,2017,3,0,0,0,0,0.00,0,0
165390,804438,2017,10,12,6,18,2772,277.00,0,0
191240,384825,2017,12,11,2,13,1768,176.00,0,0
4575,717150,2018,6,6,6,12,5112,511.00,496,40
363178,540751,2018,10,8,2,10,1450,145.00,0,0
258803,779679,2018,3,10,0,10,2650,331.25,0,0
53782,543460,2017,3,3,3,6,3204,320.00,443,36
243278,264723,2018,3,3,0,3,1986,213.84,0,0
247566,682840,2018,3,0,0,0,0,0.00,0,0
374539,246421,2018,11,7,7,14,2828,282.00,0,0
323684,238434,2018,8,6,1,7,2835,283.00,0,0

``Exploración inicial``

- información general del DataFrame
- valores nulos
- valores únicos de las columnas 
- estadísticas

In [6]:
# Con .info() obtenemos la informacion general del df (nombre columnas/no nulos/tipo de datos)

df_flight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [7]:
# .isnull() nos permite ver los valores nulos de cada columna y con .sum() contamos cuántos valores nulos hay en cada columna

df_flight.isnull().sum()

Loyalty Number                 0
Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [8]:
# Muestra la cantidad de valores únicos por columna (cantidad de valores diferentes)

df_flight.nunique()

Loyalty Number                 16737
Year                               2
Month                             12
Flights Booked                    22
Flights with Companions           12
Total Flights                     33
Distance                        4746
Points Accumulated              1549
Points Redeemed                  587
Dollar Cost Points Redeemed       49
dtype: int64

In [9]:
# Utilizamos .describe() para obtener diferentes estadísticas de los datos.

df_flight.describe().T

# No incluimos "object" porque todos los datos que tenemos son de tipo numérico.
# Utilizamos .T para cambiar filas por columnas y tener una visualización más clara.

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

Lectura de archivo Customer Loyalty History

In [10]:
df_loyalty = pd.read_csv("Customer Loyalty History.csv")

In [11]:
df_loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [12]:
df_loyalty.sample(20)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
6507,407411,Canada,Ontario,London,M5B 3E4,Female,College,NaN,Single,Nova,5252.51,Standard,2015,1,NaN,NaN
5730,389146,Canada,British Columbia,Kelowna,V09 2E9,Female,Bachelor,54643.0,Single,Nova,4305.79,Standard,2015,4,NaN,NaN
16641,935665,Canada,Ontario,Toronto,M1R 4K3,Male,Bachelor,63211.0,Divorced,Star,31221.75,Standard,2012,7,NaN,NaN
2668,472225,Canada,Quebec,Hull,J8Y 3Z5,Female,Bachelor,65844.0,Single,Aurora,8618.30,Standard,2016,8,NaN,NaN
6899,172444,Canada,Ontario,Ottawa,K1F 2R2,Male,Bachelor,70746.0,Single,Nova,5677.64,Standard,2016,11,NaN,NaN
1724,300678,Canada,Ontario,Toronto,M2M 7K8,Female,Bachelor,54363.0,Married,Aurora,6481.53,Standard,2015,8,2016.0,4.0
3848,823113,Canada,British Columbia,Whistler,V6T 1Y8,Male,College,NaN,Married,Aurora,21172.39,Standard,2013,7,NaN,NaN
5909,432031,Canada,Ontario,Ottawa,K1F 2R2,Male,Bachelor,101245.0,Married,Nova,4529.07,Standard,2016,1,NaN,NaN
8897,249693,Canada,Ontario,Toronto,P1J 8T7,Male,High School or Below,71630.0,Married,Nova,11638.90,Standard,2012,6,NaN,NaN
1424,910093,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,97030.0,Divorced,Aurora,5757.44,Standard,2018,10,NaN,NaN
3627,703109,Canada,British Columbia,West Vancouver,V6V 8Z3,Female,Bachelor,104466.0,Married,Aurora,15506.93,Standard,2014,10,NaN,NaN
7926,303049,Canada,British Columbia,Vancouver,V6E 3D9,Female,College,NaN,Married,Nova,8002.31,Standard,2018,12,NaN,NaN
15389,805159,Canada,Quebec,Montreal,H2Y 2W2,Female,Bachelor,67052.0,Divorced,Star,9101.52,Standard,2012,5,NaN,NaN
1101,749459,Canada,British Columbia,Vancouver,V5R 1W3,Female,Bachelor,81516.0,Married,Aurora,5339.49,Standard,2017,6,NaN,NaN
2044,323776,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,68615.0,Divorced,Aurora,7340.50,Standard,2018,6,NaN,NaN
9679,776464,Canada,British Columbia,Vancouver,V6E 3D9,Female,College,NaN,Single,Nova,26462.76,Standard,2013,2,NaN,NaN
16359,969764,Canada,British Columbia,Vancouver,V6E 3D9,Female,College,NaN,Single,Star,19606.36,Standard,2016,7,NaN,NaN
709,421497,Canada,Quebec,Montreal,H2T 9K8,Female,Bachelor,63840.0,Married,Star,4921.33,Standard,2015,3,NaN,NaN
2100,352280,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,95469.0,Married,Aurora,7437.69,Standard,2017,7,NaN,NaN
8667,783438,Canada,Ontario,London,M5B 3E4,Female,College,NaN,Single,Nova,10004.75,Standard,2018,9,NaN,NaN

``1. Exploración inicial``

- información general del DataFrame
- valores nulos
- valores únicos de las columnas 
- estadísticas

In [13]:
df_loyalty.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

In [14]:
df_loyalty.isnull().sum()

Loyalty Number            0
Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [15]:
df_loyalty.nunique()

Loyalty Number        16737
Country                   1
Province                 11
City                     29
Postal Code              55
Gender                    2
Education                 5
Salary                 5890
Marital Status            3
Loyalty Card              3
CLV                    7984
Enrollment Type           2
Enrollment Year           7
Enrollment Month         12
Cancellation Year         6
Cancellation Month       12
dtype: int64

In [16]:
df_loyalty.describe().T

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,16737.0,549735.880445,258912.132453,100018.00,326603.00,550434.00,772019.00,999986.00
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

``Unión los dos conjuntos de datos``

In [ ]:
# Utilizamos .merge para vincular ambos DataFrames por una columna común; en este caso Loyalty Number.

# Tipo de vinculación elegida: outer. 
# Así evitamos perder datos ya que nos incluye todos los registros, ya que la vinculación inner eliminaría los registros que no coinciden en ambos DataFrames.

In [ ]:
df_union = pd.merge(df_flight, df_loyalty, on='Loyalty Number', how='outer')

In [18]:
df_union

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,7290.07,Standard,2014,5,NaN,NaN
405620,999911,2018,12,0,0,0,0,0.0,0,0,...,Doctor,217943.0,Single,Nova,8564.77,Standard,2012,8,NaN,NaN
405621,999940,2018,12,3,0,3,1233,123.0,0,0,...,Bachelor,47670.0,Married,Nova,20266.50,Standard,2017,7,NaN,NaN
405622,999982,2018,12,0,0,0,0,0.0,0,0,...,College,NaN,Married,Star,2631.56,Standard,2018,7,NaN,NaN
405623,999986,2018,12,0,0,0,0,0.0,0,0,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN

In [19]:
df_union.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

``2. Limpieza de Datos``

Eliminamos o tratamos los valores nulos, si los hay, en las columnas clave para asegurar que los datos estén completos.